# Read and Write data in Pandas
Reference : https://pandas.pydata.org/pandas-docs/stable/io.html

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/Users/Akshay/Documents/SalesJan2009.csv')

In [3]:
df.head()

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500000,-1.116667
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195000,-94.681940
2,1/2/09 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,1/1/09 16:21,1/3/09 12:32,46.188060,-123.830000
3,1/3/09 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia,9/25/05 21:13,1/3/09 14:22,-36.133333,144.750000
4,1/4/09 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States,11/15/08 15:47,1/4/09 12:45,33.520560,-86.802500

In [9]:
df.shape

(998, 12)

In [10]:
df.to_json('/Users/Akshay/Documents/SalesJan2009.json')

In [11]:
df.to_html('/Users/Akshay/Documents/SalesJan2009.html')

# Adding and deleting coloumns

In [12]:
import pandas as pd

In [13]:
a = [0,-3,5,6,8,-34,5,34]

In [14]:
adf = pd.DataFrame(a)

In [15]:
adf

    0
0   0
1  -3
2   5
3   6
4   8
5 -34
6   5
7  34

In [21]:
adf.columns= ['Values']

In [22]:
adf

   Values
0       0
1      -3
2       5
3       6
4       8
5     -34
6       5
7      34

In [24]:
i = ['a','b','c','d','e','f','g','h']

In [26]:
adf.index = i

In [27]:
adf

   Values
a       0
b      -3
c       5
d       6
e       8
f     -34
g       5
h      34

In [28]:
adf['NewCol'] = 1

In [29]:
adf

   Values  NewCol
a       0       1
b      -3       1
c       5       1
d       6       1
e       8       1
f     -34       1
g       5       1
h      34       1

In [30]:
adf['NewCol'] =adf['NewCol'] +8

In [31]:
adf

   Values  NewCol
a       0       9
b      -3       9
c       5       9
d       6       9
e       8       9
f     -34       9
g       5       9
h      34       9

In [32]:
adf['NewCol1'] = adf['Values']

In [33]:
adf

   Values  NewCol  NewCol1
a       0       9        0
b      -3       9       -3
c       5       9        5
d       6       9        6
e       8       9        8
f     -34       9      -34
g       5       9        5
h      34       9       34

In [35]:
del adf['NewCol1']

In [36]:
adf

   Values  NewCol
a       0       9
b      -3       9
c       5       9
d       6       9
e       8       9
f     -34       9
g       5       9
h      34       9